/*
********************************************************************************
* animal.c
*
*   Author: AlexShi <shiweining123@gmail.com>
*
********************************************************************************
*/

/*
********************************************************************************
* Included Files
********************************************************************************
*/

#include "animal.h"

/*
********************************************************************************
* Pre-processor Definitions
********************************************************************************
*/



/*
********************************************************************************
* Shared Types
********************************************************************************
*/



/*
********************************************************************************
* Private Types
********************************************************************************
*/



/*
********************************************************************************
* Private Function Prototypes
********************************************************************************
*/



/*
********************************************************************************
* Shared Data
********************************************************************************
*/



/*
********************************************************************************
* Private Data
********************************************************************************
*/



/*
********************************************************************************
* Private Functions
********************************************************************************
*/

/*
 * @brief
 *
 * @param
 *
 * @return
 *
 * @notes
 */



/*
********************************************************************************
* Public Functions
********************************************************************************
*/

/*
 * @brief 动物初始化
 *
 * @param
 *
 * @return 无
 *
 * @notes
 */
void animal_init(animal_t * const self, animal_vtbl_t const *vtbl, int type, const char *name, int age)
{
    self->type = type;
    self->name = name;
    self->age  = age;
    self->vtbl = vtbl;
}

/*
 * @brief 设置动物的昵称
 *
 * @param
 *
 * @return 无
 *
 * @notes
 */
void animal_set_name(animal_t * const self, const char *name)
{
    self->name = name;
}

/*
 * @brief 设置动物的年龄
 *
 * @param
 *
 * @return 无
 *
 * @notes
 */
void animal_set_age(animal_t * const self, int age)
{
    self->age = age;
}

/*
 * @brief 动物打招呼
 *
 * @param
 *
 * @return 无
 *
 * @notes
 */
void animal_say(animal_t * const self)
{
    printf("Hello! 我是%s, 今年%d岁了!\n", self->name, self->age);
}

/*
 * @brief 动物都会吃
 *
 * @param
 *
 * @return 无
 *
 * @notes
 */
void animal_eat(animal_t const * const self)
{
    const animal_vtbl_t *vtbl = self->vtbl;

    return vtbl->eat(self);
}

/*
 * @brief 动物都会呼吸
 *
 * @param
 *
 * @return 无
 *
 * @notes
 */
void animal_breathe(animal_t const * const self)
{
    const animal_vtbl_t *vtbl = self->vtbl;

    return vtbl->breathe(self);
}

/*
 * @brief 销毁
 *
 * @param
 *
 * @return 无
 *
 * @notes
 */
void animal_distory(animal_t * const self)
{
    const animal_vtbl_t *vtbl = self->vtbl;

    vtbl->distory(self);
}

/*
********************************************************************************
* No More!
********************************************************************************
*/
